def ex(I):
    if 0<=I<=10:
        s=0.1*I
        print('奖金(单位：万元)：',s)
    elif 10<I<=20:
        s=1+0.75*(I-10)
        print('奖金(单位：万元)：',s )
    elif 20<I<=40:
        s=1+0.75*(I-10)+0.05*(I-20)
        print('奖金(单位：万元)：',s)
    elif 40<I<=60:
        s = 1 + 0.75 * (I - 10) + 0.05 * (I - 20)+0.03*(I-40)
        print('奖金(单位：万元)：',s )
    elif  60<I<=100:
        s = 1 + 0.75 * (I - 10) + 0.05 * (I - 20) + 0.03 * (I - 40)+0.015*(I-60)
        print('奖金(单位：万元)：',s )
    elif I>100:
        s = 1 + 0.75 * (I - 10) + 0.05 * (I - 20) + 0.03 * (I - 40) + 0.015 * (I - 60)+0.01*(I-100)
    print('奖金(单位：万元)：',s)

ex(200)



